[{
    "uniqueName": "suchmaschinenoptimierung-fuer-angular-applikationen",
    "author": {
      "name": "Frank Strieter",
      "mail": "fs@co-IT.eu",
      "twitter": "@FrankStrieter"
    },
    "post": {
      "header": "Suchmaschinenoptimierung für Angular Applikationen",
      "content": "Single Page Anwendungen, die mit einem JavaScript Framework wie Angular geschrieben werden, sind beliebter als je zuvor. Die Inhalte weisen eine hohe Dynamik innerhalb einer Webseite aus. Die Inhalte werden mit JavaScript dynamisch in das Dokument geladen. Viele Suchmaschinen-Bots, welche die Webseiten auf Inhalte durchsuchen, können dieses JavaScript nicht oder unzureichend ausführen. Das führt dazu, dass es Suchmaschinen schwer haben, diese Inhalte im Gesamten zu erfassen. Es ergibt sich für die erwarteten Suchbegriffe kein bzw. ein schlechtes Ranking auf der Suchergebnisseite. Es gibt eine Reihe Techniken, die sich bei der Suchmaschinenoptimierung behauptet haben und welche als Best Practices angesehen werden. Dazu zählen unter anderem das hinterlegen von seitenspezifischen Meta-Tags und eine kurze Antwortzeit der Seite bis zum ‚First Meaningful Paint‘. Im Folgenden lernen Sie Angulars Werkzeuge kennen, die Ihnen helfen ein gutes Ranking bei allen Suchmaschinen zu erreichen. <h2>Nutzung von HTML5 Elementen</h2> Durch das Komponentenbasierte Design von Angular-Anwendungen und dem damit verbundenen Erstellen von eigenen HTML-Tags für jede einzelne Komponente, wird meist vergessen, dass für viele dieser Elemente bereits Tags existieren. Suchmaschinen analysieren die Seiten auf Ihre semantische Struktur. Nutz man nun selbst erstellte Tags zur Strukturierung können die Inhalte einem bestimmten Kontext nicht zugeordnet werden. Für eine Blog-Anwendung ist es beispielsweise hilfreich, das Article-Element zu nutzen. Dadurch können Suchmaschinen den Artikel und seine Meta-Informationen wie address (Die Kontaktinformationen der Autoren) und time (Das Datum der Publizierung) indexieren und so als Ergebnisse in zum Beispiel einer Nachrichtensuche einordnen. Weitere Beispiele für suchmaschinenfreundliche HTML5-Tags sind in Tabelle 1 gelistet."
    },
    "visible": true,
    "description": "Die Inhalte weisen eine hohe Dynamik innerhalb einer Webseite aus. Die Inhalte werden mit JavaScript dynamisch in das Dokument geladen. Viele Suchmaschinen-Bots, welche die Webseiten auf Inhalte durchsuchen, können dieses JavaScript nicht oder unzureichend ausführen...."
  },
  {
      "uniqueName": "angular-at-scale",
    "author": {
      "name": "Gregor Woiwode",
      "mail": "gw@co-IT.eu",
      "twitter": "@GregOnNet"
    },
    "post": {
      "header": "Angular at Scale",
      "content": "noch mehr bla"
    },
    "visible": true,
    "description": "bla bla"
  },
  {
      "uniqueName": "keine-ahnung",
    "author": {
      "name": "Uli Armbruster",
      "mail": "ua@co-IT.eu",
      "twitter": "@UliArmbruster"
    },
    "post": {
      "header": "Keine Ahnung",
      "content": "Noch weniger Ahnung"
    },
    "visible": true,
    "description": "bla bla 2"
  }
]
